{
  "format": "layers-model",
  "generatedBy": "BreedAI-Converter",
  "convertedBy": "Fallback System",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "breed_classifier",
      "layers": []
    }
  },
  "weightsManifest": [],
  "userDefinedMetadata": {
    "note": "Placeholder for TensorFlow.js path. Production inference uses breed_classifier.onnx via onnxResNet50Service.",
    "primaryModel": "breed_classifier.onnx",
    "breeds": 41
  }
}